#include <stdio.h>

int main() {

//     char str[] = {'G', 'a', 'z', 'd', 'i', 'e', 'v'};
//     char s[] = "Gazdiev Ilishan";
//     char buffer[512] = "Hello World";

//     char b[] = "Hel" "lo"
//                 ", World";

//     char sp[] = "Hello, \
// World";

//     printf("str = %s\n", str);
//     printf("s = %s\n", s);
//     printf("buffer = %s\n", buffer);
//     printf("b = %s\n", b);
//     printf("sp = %s\n", sp);




    // char *str = "Gazdiev";
    // const char *str = "Gazdiev";
    // char s[] = "Gazdiev";

    // str[0] = 'A'; do not do like that this is error

    // s[0] = 'A' you can do for this variable s[] but can't do for this *s[]






    // char s[] = "I like programming in "C" language."; do not do like that this is error 

    // char s[] = "I like programming in \"C\" language.";

    // printf("s[] = %s\n", s);
    // puts(s);
    


    /*
        ________________________________________________________________________________________________________________________
        | escape-последовательность | Код в таблице ASCII | Описание                                                           |
        |___________________________|_____________________|____________________________________________________________________|
        |              \n           |         0x0A        | перевод на новую строку                                            |
        |___________________________|_____________________|____________________________________________________________________|
        |              \r           |         0x0D        | возврат каретки                                                    |
        |___________________________|_____________________|____________________________________________________________________|
        |              \t           |         0x09        | символ табуляции                                                   |
        |___________________________|_____________________|____________________________________________________________________|
        |              \'           |         0x27        | экранирование апострофа (одинарная кавычка)                        | 
        |___________________________|_____________________|____________________________________________________________________|
        |              \"           |         0x22        | экранирование двойной кавычки                                      |
        |___________________________|_____________________|____________________________________________________________________|
        |              \?           |         0x3F        | экранирование вопросительного знака                                |
        |___________________________|_____________________|____________________________________________________________________|
        |              \\           |         0x5C        | экранирование обратного слеша                                      |
        |___________________________|_____________________|____________________________________________________________________|
        |              \0           |         0x00        | символ конца строки (число 0)                                      |
        |___________________________|_____________________|____________________________________________________________________|
        |          \x<число>        |                     | символ с указанием шестнадцатеричным значением                     |
        |___________________________|_____________________|____________________________________________________________________|
        |          \uxxxx           |                     | символ с кодом xxxx в кодировке UNICODE (добавлено в стандарт c99) |   
        |___________________________|_____________________|____________________________________________________________________|


    */ 


   char s[] = "I like programming in \"C\" language.";
   puts(s);

    char str[] = "\x61 \x4f";
    puts(str);
    return 0;

}