#include <stdio.h>

int main() {

    /* Битовая операция НЕ (~)
    
        __________
        | x | НЕ |
        | 0 |  1 |
        | 1 |  0 |
    
    
    unsigned char var = 153; //Двоичная запись 10011001
    unsigned char not_v = ~var; // Результат: 01100110 (число 102)

    printf("var = %d \t not v = %d\n", var, not_v);

    */ 
   
    






    /* Битовая операция И
    
        | x | y | И(&) |
        | 0 | 0 |   0  |
        | 0 | 1 |   0  |
        | 1 | 0 |   0  |
        | 1 | 1 |   1  |
    
    */ 


   // unsigned char flags = 5;  двоичная запись 00000101
   // unsigned char mask = 4;  двоичная запись 00000100

//    unsigned char res = flags & mask;

    // if((flags & mask) == mask) {
    //     printf("bit 2 is on");
    // } else {
    //     printf("bit is off");
    // }

//    printf("res = %d\n", res);


    // unsigned char flags = 13; // двоичная запись 00001101
    // unsigned char mask = 5;  //  двоичная запись 00000101

    // flags = flags & ~mask;

    // printf("flags = %d\n", flags);








    /* Битовая операция ИЛИ
    
        | x | y | ИЛИ(|) |
        | 0 | 0 |    0   |
        | 0 | 1 |    1   |
        | 1 | 0 |    1   |
        | 1 | 1 |    1   |
    
    */ 


//    unsigned char flags = 8; // двоичная запись 00001000
//    unsigned char mask = 5; // двоичная запись 00000101


//    flags = flags | mask;

//    printf("flags = %d\n", flags);

        






    /* Битовая операция XOR

        | x | y | XOR (^) |
        | 0 | 0 |    0    |
        | 0 | 1 |    1    |
        | 1 | 0 |    1    |
        | 1 | 1 |    0    |

    */


//    unsigned char flags = 9; // двоичная запись 00001001
//    unsigned char mask = 1; // двоичная запись  00000001 

//    flags = flags ^ mask;
//    printf("flags = %d\n", flags);




    /* Приоритеты битовых операций
         _____________________________________________
        |                |               |            |
        | Бинарная форма | Краткая форма | Приоритеты |
        |________________|_______________|____________|
        | ~a;            |               |    4 (НЕ)  |
        |________________|_______________|____________|
        | a = a & b;     |    a &= b     |    3 (И)   |
        |________________|_______________|____________|
        | a = a ^ b;     |    a ^= b     |    2 (XOR) |
        |________________|_______________|____________|
        | a = a | b;     |    a |= b;    |    1 (ИЛИ) |
        |________________|_______________|____________|
    
    */ 




    /* Битовые операции сдвига >> и <<

        1. >> смещение бит вправо
        2. << смещение бит влево
    
    */  


    unsigned char x = 40; // 00101000
    printf("x = %d\n", x);

    
    x = x >> 1;                 // 00010100 (число 20)
    printf("x = %d\n", x);


    x = x >> 2;                 // 00000101 (число 5)
    printf("x = %d\n", x);


    x = x >> 1;                 // 00000010 (число 2)
    printf("x = %d\n", x);


    x = x >> 1;                 // 00000001 (число 1)
    printf("x = %d\n", x);

    x = x << 1;                 // 00000010 (число 2)
    printf("x = %d\n", x);
    

    x = x << 2;                 // 00001000 (число 8)
    printf("x = %d\n", x);



    signed char y = -128; // 1000 0000
    printf("y = %d\n", y);

    y = y << 1; 
    printf("y = %d\n", y);


    y = -128;

    y = y >> 1;
    printf("y = %d\n", y);


    return 0;
} 